In [1]:
import pandas as pd
import numpy as np

In [2]:
sozluk1={"Isim":["Ahmet","Mehmet","Zeynep","Atil"],
         "Spor":["Koşu","Yüzme","Koşu","Basketbol"],
        "Kalori":[100,200,300,400]}

In [3]:
dataFrame1=pd.DataFrame(sozluk1,index=[0,1,2,3])

In [4]:
dataFrame1

     Isim       Spor  Kalori
0   Ahmet       Koşu     100
1  Mehmet      Yüzme     200
2  Zeynep       Koşu     300
3    Atil  Basketbol     400

In [5]:
sozluk2={"Isim":["Osman","Levent","Atlas","Fatma"],
         "Spor":["Koşu","Yüzme","Koşu","Basketbol"],
        "Kalori":[200,100,500,300]}

In [6]:
dataFrame2=pd.DataFrame(sozluk2,index=[4,5,6,7])

In [7]:
dataFrame2

     Isim       Spor  Kalori
4   Osman       Koşu     200
5  Levent      Yüzme     100
6   Atlas       Koşu     500
7   Fatma  Basketbol     300

In [8]:
sozluk3={"Isim":["Ayşe","Mahmut","Duygu","Nur"],
         "Spor":["Koşu","Yüzme","Badminton","Tenis"],
        "Kalori":[300,500,500,400]}

In [9]:
dataFrame3=pd.DataFrame(sozluk3,index=[8,9,10,11])

In [10]:
dataFrame3

      Isim       Spor  Kalori
8     Ayşe       Koşu     300
9   Mahmut      Yüzme     500
10   Duygu  Badminton     500
11     Nur      Tenis     400

## concatenation

In [11]:
pd.concat([dataFrame1,dataFrame2,dataFrame3],axis=0) #concat birleşitme yapar sutunlar aynıysa

      Isim       Spor  Kalori
0    Ahmet       Koşu     100
1   Mehmet      Yüzme     200
2   Zeynep       Koşu     300
3     Atil  Basketbol     400
4    Osman       Koşu     200
5   Levent      Yüzme     100
6    Atlas       Koşu     500
7    Fatma  Basketbol     300
8     Ayşe       Koşu     300
9   Mahmut      Yüzme     500
10   Duygu  Badminton     500
11     Nur      Tenis     400

## merge

In [12]:
mergeSozluk1={"Isim":["Ahmet","Mehmet","Zeynep","Atil"],
             "Spor":["Kosu","Yuzme","Kosu","Basketbol"],
             }

In [13]:
mergeDataFrame1=pd.DataFrame(mergeSozluk1)

In [14]:
mergeDataFrame1

     Isim       Spor
0   Ahmet       Kosu
1  Mehmet      Yuzme
2  Zeynep       Kosu
3    Atil  Basketbol

In [15]:
mergeSozluk2={"Isim":["Ahmet","Mehmet","Zeynep","Atil"],
             "Kalori":[100,200,150,250],
             }

In [16]:
mergeDataFrame2=pd.DataFrame(mergeSozluk2)

In [17]:
mergeDataFrame2

     Isim  Kalori
0   Ahmet     100
1  Mehmet     200
2  Zeynep     150
3    Atil     250

In [18]:
pd.merge(mergeDataFrame1,mergeDataFrame2,on="Isim") #on, hangi sutun baz alınarak birleştirme yapılsın

     Isim       Spor  Kalori
0   Ahmet       Kosu     100
1  Mehmet      Yuzme     200
2  Zeynep       Kosu     150
3    Atil  Basketbol     250